public class Main {
    public static void main(String[] args) {
        int ticetPrice = 12155; // Стоимость билета в рублях
        int milesPer20Rubles = 1; // Бонусные мили за каждые 20 рублей
        int bonusMiles = ticetPrice / 20; // бонусные мили за стоимость билета
        System.out.println("Начисленные бонусные мили:" + bonusMiles);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}